Revit 2026 API

# ViewportSetBoxCenter Method

---

Moves this viewport so that the center of the box outline (excluding the viewport label) is at a given point.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetBoxCenter(
	XYZ newCenterPoint
)
```
```vb
Public Sub SetBoxCenter (
	newCenterPoint As XYZ
)
```
```cpp
public:
void SetBoxCenter(
	XYZ^ newCenterPoint
)
```
```fsharp
member SetBoxCenter :
        newCenterPoint : XYZ -> unit
```

#### Parameters

newCenterPoint XYZ
     The desired center for the box outline.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |
| InvalidOperationException | The viewport is not on a sheet. |

#### Reference

Viewport Class

Autodesk.Revit.DB Namespace